In [98]:
import pandas as pd
import numpy as np
data = {"Roll No": [1,2,3,4,5,6,7,8,9,10],
       "Name": ["Rahul", "Rohan", "Shruti", "Parth", np.NaN, np.NaN, "Priti", "Geet", "Anjali", "Sanjay"],
        "Marks": [-20, 19, 50, 70,80,40, np.NaN, 75, 30, 1000]
       }

df = pd.DataFrame(data)
print(df)

   Roll No    Name   Marks
0        1   Rahul   -20.0
1        2   Rohan    19.0
2        3  Shruti    50.0
3        4   Parth    70.0
4        5     NaN    80.0
5        6     NaN    40.0
6        7   Priti     NaN
7        8    Geet    75.0
8        9  Anjali    30.0
9       10  Sanjay  1000.0

In [99]:
df.isnull()

   Roll No   Name  Marks
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False   True  False
5    False   True  False
6    False  False   True
7    False  False  False
8    False  False  False
9    False  False  False

In [100]:
mean_marks = df["Marks"].mean()
print(mean_marks)

149.33333333333334

In [101]:
pd.isnull(df["Name"])
df["Marks"].fillna(mean_marks, inplace=True)
print(df)

   Roll No    Name        Marks
0        1   Rahul   -20.000000
1        2   Rohan    19.000000
2        3  Shruti    50.000000
3        4   Parth    70.000000
4        5     NaN    80.000000
5        6     NaN    40.000000
6        7   Priti   149.333333
7        8    Geet    75.000000
8        9  Anjali    30.000000
9       10  Sanjay  1000.000000

In [102]:
pd.isnull(df["Name"])
df["Name"].fillna("No Name", inplace=True)
print(df)

   Roll No     Name        Marks
0        1    Rahul   -20.000000
1        2    Rohan    19.000000
2        3   Shruti    50.000000
3        4    Parth    70.000000
4        5  No Name    80.000000
5        6  No Name    40.000000
6        7    Priti   149.333333
7        8     Geet    75.000000
8        9   Anjali    30.000000
9       10   Sanjay  1000.000000

OUTLIERS

In [103]:
Q1 = np.percentile(df["Marks"], 25, interpolation="midpoint")
Q3 = np.percentile(df["Marks"], 75, interpolation="midpoint")
IQR = Q3 - Q1
print("Quartile 1: ",Q1)
print("Quartile 3: ",Q3)
print("Inter Quartile Range: ",IQR)

Quartile 1:  35.0
Quartile 3:  77.5
Inter Quartile Range:  42.5

In [104]:
low_limit = Q1 - 1.5 * IQR
up_limit = Q3 + 1.5 * IQR
print("Lower Limit is: ",low_limit)
print("Upper Limit is: ", up_limit)

Lower Limit is:  -28.75
Upper Limit is:  141.25

In [105]:
outliers = []
for x in df["Marks"]:
    if((x>up_limit) or (x<low_limit)):
        outliers.append(x)
    
print("Outliers in the dataset are: ", outliers)

Outliers in the dataset are:  [149.33333333333334, 1000.0]

DATA TRANSFORMATION

In [106]:
df["Marks"] = df["Marks"].transform(lambda x : x+5)
print(df)

   Roll No     Name        Marks
0        1    Rahul   -15.000000
1        2    Rohan    24.000000
2        3   Shruti    55.000000
3        4    Parth    75.000000
4        5  No Name    85.000000
5        6  No Name    45.000000
6        7    Priti   154.333333
7        8     Geet    80.000000
8        9   Anjali    35.000000
9       10   Sanjay  1005.000000